{
  "problemas": [
    {
      "pregunta": "No tengo conexión a Internet",
      "solucion": "Verifica que el cable esté conectado correctamente y reinicia el router y el módem."
    },
    {
      "pregunta": "Experiencia de Internet lenta",
      "solucion": "¿Has verificado la velocidad de tu conexión? Puedes usar herramientas en línea para hacerlo. Si eso no ayuda, considera cambiar a una conexión por cable en lugar de inalámbrica para mejorar la velocidad."
    },
    {
      "pregunta": "¿Cómo mejorar la velocidad de mi conexión Wi-Fi?",
      "solucion": "Considera actualizar a un router más reciente y compatible con estándares Wi-Fi modernos para obtener velocidades más altas."
    },
    {
      "pregunta": "¿Cómo mejorar la seguridad de mi red Wi-Fi?",
      "solucion": "Mantén tu red segura usando una contraseña fuerte que combine letras, números y caracteres especiales. Además, habilita la encriptación WPA3 y cambia el nombre predeterminado de la red (SSID) para evitar posibles ataques."
    },
    {
      "pregunta": "¿Cómo solucionar problemas de asignación de direcciones IP?",
      "solucion": "Verifica la configuración del servidor DHCP en tu router y evita conflictos de direcciones IP. Si los problemas persisten, considera renovar manualmente las direcciones IP en tus dispositivos."
    },
    {
      "pregunta": "¿Qué hacer si olvidé la contraseña de mi red Wi-Fi?",
      "solucion": "Si olvidaste la contraseña, puedes restablecer el router a la configuración de fábrica. Luego, configura una nueva contraseña. La información suele estar en la etiqueta del router."
    },
    {
      "pregunta": "¿Cómo saber si mi router ha sido comprometido?",
      "solucion": "Monitorea el tráfico inusual en la interfaz del router, cambia las contraseñas regularmente y mantén el firmware actualizado para prevenir vulnerabilidades conocidas."
    },
    {
      "pregunta": "¿Cómo solucionar problemas de conectividad en un dispositivo específico?",
      "solucion": "Si experimentas problemas en un dispositivo en particular, reinícialo, olvida y vuelve a conectar la red Wi-Fi, y verifica si hay problemas de configuración en el dispositivo."
    },
    {
      "pregunta": "¿Cómo evitar interferencias de otras redes Wi-Fi cercanas?",
      "solucion": "Evita interferencias cambiando el canal de transmisión del router y utilizando una banda de frecuencia menos congestionada, si es posible."
    },
    {
      "pregunta": "¿Cómo solucionar problemas de DNS?",
      "solucion": "Para problemas de DNS, cambia los servidores DNS a opciones confiables como los de Google (8.8.8.8 y 8.8.4.4). También, reinicia el router y el dispositivo, y verifica la configuración de red en el router."
    },
    {
      "pregunta": "¿Qué hacer si hay cortes de energía frecuentes?",
      "solucion": "Usa un respaldo de energía para el router, considera un regulador de voltaje y verifica problemas eléctricos en la instalación para abordar cortes frecuentes."
    },
    {
      "pregunta": "¿Qué hacer si el router se calienta demasiado?",
      "solucion": "Asegúrate de que el router esté bien ventilado y no colocado cerca de fuentes de calor. Si es necesario, añade enfriamiento adicional, como un ventilador."
    },
    {
      "pregunta": "¿Qué hacer si las luces del router parpadean de manera anormal?",
      "solucion": "Consulta el manual del router para interpretar las luces, verifica la conexión de cables y considera reiniciar el router para solucionar problemas temporales."
    },
    {
      "pregunta": "¿Cómo solucionar problemas de conexión en dispositivos móviles?",
      "solucion": "Para problemas en dispositivos móviles, reinícialos, olvida y vuelve a conectar la red Wi-Fi, y verifica si hay actualizaciones de software disponibles."
    },
    {
      "pregunta": "¿Qué hacer si la velocidad de la conexión Wi-Fi varía en diferentes momentos del día?",
      "solucion": "Verifica interferencias, considera la configuración de QoS en el router para priorizar ciertos tipos de tráfico y contacta a tu proveedor para evaluar la velocidad de tu plan de Internet."
    },
    {
      "pregunta": "¿Cómo evitar que mi red sea vulnerable a ataques?",
      "solucion": "Cambia las contraseñas regularmente, activa el filtrado de direcciones MAC y actualiza el firmware del router para corregir posibles vulnerabilidades."
    },
    {
      "pregunta": "¿Cómo solucionar problemas de latencia en juegos en línea?",
      "solucion": "Reduce la latencia utilizando la conexión por cable, configura QoS en el router para priorizar el tráfico de juegos y verifica la velocidad de tu conexión."
    },
    {
      "pregunta": "¿Qué hacer si el router no reconoce algunos dispositivos?",
      "solucion": "Verifica la compatibilidad de los dispositivos con la red Wi-Fi, actualiza el firmware del router y considera utilizar asignación de direcciones IP estáticas si es posible."
    },
    {
      "pregunta": "¿Cómo saber si mi red Wi-Fi está siendo utilizada por otros sin autorización?",
      "solucion": "Revisa la lista de dispositivos conectados en la interfaz del router, cambia la contraseña de la red Wi-Fi y activa la seguridad WPA3 para mayor protección."
    },
    {
      "pregunta": "¿Cómo solucionar problemas de port forwarding para aplicaciones específicas?",
      "solucion": "Verifica la configuración de port forwarding en el router, asegúrate de que las reglas sean correctas y revisa si hay conflictos de puertos para la aplicación específica."
    },
    {
      "pregunta": "¿Qué hacer si experimento desconexiones al transmitir videos o hacer videollamadas?",
      "solucion": "Asegúrate de tener suficiente ancho de banda, verifica la configuración de QoS y considera priorizar el tráfico de video en la red para una mejor experiencia."
    },
    {
      "pregunta": "¿Qué significa si la luz de encendido del router está apagada?",
      "solucion": "Si la luz de encendido está apagada, el router no está recibiendo energía. Verifica si está enchufado correctamente o si hay un problema con la fuente de alimentación."
    },
    {
      "pregunta": "¿Por qué la luz de Internet en el router está parpadeando?",
      "solucion": "El parpadeo de la luz de Internet indica que el router está intentando establecer una conexión a Internet. Puede ser necesario verificar la configuración del proveedor de servicios o reiniciar el router."
    },
    {
      "pregunta": "¿Qué significa la luz WLAN/AP en el router?",
      "solucion": "La luz WLAN/AP indica la actividad inalámbrica. Si está apagada, puede ser que la función Wi-Fi esté desactivada o que haya un problema con la configuración del Wi-Fi."
    },
    {
      "pregunta": "¿Por qué la luz de Ethernet en el router no está encendida?",
      "solucion": "Si la luz de Ethernet no está encendida, puede indicar un problema con el cable de red o el dispositivo conectado. Verifica las conexiones y reinicia el router si es necesario."
    },
    {
      "pregunta": "¿Qué hacer si la luz de WPS en el router está parpadeando?",
      "solucion": "El parpadeo de la luz WPS indica que el router está en modo de emparejamiento. Si no estás configurando nuevos dispositivos, puedes desactivar la función WPS para mayor seguridad."
    }
  ]
}
